espressif/esp-idf/components/soc/esp32h2/register/soc/apb_saradc_reg.h
/**
 * SPDX-FileCopyrightText: 2022-2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** APB_SARADC_CTRL_REG register
 *  digital saradc configure register
 */
#define APB_SARADC_CTRL_REG (DR_REG_APB_SARADC_BASE + 0x0)
/** APB_SARADC_SARADC_START_FORCE : R/W; bitpos: [0]; default: 0;
 *  select software enable saradc sample
 */
#define APB_SARADC_SARADC_START_FORCE    (BIT(0))
#define APB_SARADC_SARADC_START_FORCE_M  (APB_SARADC_SARADC_START_FORCE_V << APB_SARADC_SARADC_START_FORCE_S)
#define APB_SARADC_SARADC_START_FORCE_V  0x00000001U
#define APB_SARADC_SARADC_START_FORCE_S  0
/** APB_SARADC_SARADC_START : R/W; bitpos: [1]; default: 0;
 *  software enable saradc sample
 */
#define APB_SARADC_SARADC_START    (BIT(1))
#define APB_SARADC_SARADC_START_M  (APB_SARADC_SARADC_START_V << APB_SARADC_SARADC_START_S)
#define APB_SARADC_SARADC_START_V  0x00000001U
#define APB_SARADC_SARADC_START_S  1
/** APB_SARADC_SARADC_SAR_CLK_GATED : R/W; bitpos: [6]; default: 1;
 *  SAR clock gated
 */
#define APB_SARADC_SARADC_SAR_CLK_GATED    (BIT(6))
#define APB_SARADC_SARADC_SAR_CLK_GATED_M  (APB_SARADC_SARADC_SAR_CLK_GATED_V << APB_SARADC_SARADC_SAR_CLK_GATED_S)
#define APB_SARADC_SARADC_SAR_CLK_GATED_V  0x00000001U
#define APB_SARADC_SARADC_SAR_CLK_GATED_S  6
/** APB_SARADC_SARADC_SAR_CLK_DIV : R/W; bitpos: [14:7]; default: 4;
 *  SAR clock divider
 */
#define APB_SARADC_SARADC_SAR_CLK_DIV    0x000000FFU
#define APB_SARADC_SARADC_SAR_CLK_DIV_M  (APB_SARADC_SARADC_SAR_CLK_DIV_V << APB_SARADC_SARADC_SAR_CLK_DIV_S)
#define APB_SARADC_SARADC_SAR_CLK_DIV_V  0x000000FFU
#define APB_SARADC_SARADC_SAR_CLK_DIV_S  7
/** APB_SARADC_SARADC_SAR_PATT_LEN : R/W; bitpos: [17:15]; default: 7;
 *  0 ~ 15 means length 1 ~ 16
 */
#define APB_SARADC_SARADC_SAR_PATT_LEN    0x00000007U
#define APB_SARADC_SARADC_SAR_PATT_LEN_M  (APB_SARADC_SARADC_SAR_PATT_LEN_V << APB_SARADC_SARADC_SAR_PATT_LEN_S)
#define APB_SARADC_SARADC_SAR_PATT_LEN_V  0x00000007U
#define APB_SARADC_SARADC_SAR_PATT_LEN_S  15
/** APB_SARADC_SARADC_SAR_PATT_P_CLEAR : R/W; bitpos: [23]; default: 0;
 *  clear the pointer of pattern table for DIG ADC1 CTRL
 */
#define APB_SARADC_SARADC_SAR_PATT_P_CLEAR    (BIT(23))
#define APB_SARADC_SARADC_SAR_PATT_P_CLEAR_M  (APB_SARADC_SARADC_SAR_PATT_P_CLEAR_V << APB_SARADC_SARADC_SAR_PATT_P_CLEAR_S)
#define APB_SARADC_SARADC_SAR_PATT_P_CLEAR_V  0x00000001U
#define APB_SARADC_SARADC_SAR_PATT_P_CLEAR_S  23
/** APB_SARADC_SARADC_XPD_SAR_FORCE : R/W; bitpos: [28:27]; default: 0;
 *  force option to xpd sar blocks
 */
#define APB_SARADC_SARADC_XPD_SAR_FORCE    0x00000003U
#define APB_SARADC_SARADC_XPD_SAR_FORCE_M  (APB_SARADC_SARADC_XPD_SAR_FORCE_V << APB_SARADC_SARADC_XPD_SAR_FORCE_S)
#define APB_SARADC_SARADC_XPD_SAR_FORCE_V  0x00000003U
#define APB_SARADC_SARADC_XPD_SAR_FORCE_S  27
/** APB_SARADC_SARADC2_PWDET_DRV : R/W; bitpos: [29]; default: 0;
 *  enable saradc2 power detect driven func.
 */
#define APB_SARADC_SARADC2_PWDET_DRV    (BIT(29))
#define APB_SARADC_SARADC2_PWDET_DRV_M  (APB_SARADC_SARADC2_PWDET_DRV_V << APB_SARADC_SARADC2_PWDET_DRV_S)
#define APB_SARADC_SARADC2_PWDET_DRV_V  0x00000001U
#define APB_SARADC_SARADC2_PWDET_DRV_S  29
/** APB_SARADC_SARADC_WAIT_ARB_CYCLE : R/W; bitpos: [31:30]; default: 1;
 *  wait arbit signal stable after sar_done
 */
#define APB_SARADC_SARADC_WAIT_ARB_CYCLE    0x00000003U
#define APB_SARADC_SARADC_WAIT_ARB_CYCLE_M  (APB_SARADC_SARADC_WAIT_ARB_CYCLE_V << APB_SARADC_SARADC_WAIT_ARB_CYCLE_S)
#define APB_SARADC_SARADC_WAIT_ARB_CYCLE_V  0x00000003U
#define APB_SARADC_SARADC_WAIT_ARB_CYCLE_S  30

/** APB_SARADC_CTRL2_REG register
 *  digital saradc configure register
 */
#define APB_SARADC_CTRL2_REG (DR_REG_APB_SARADC_BASE + 0x4)
/** APB_SARADC_SARADC_MEAS_NUM_LIMIT : R/W; bitpos: [0]; default: 0;
 *  enable max meas num
 */
#define APB_SARADC_SARADC_MEAS_NUM_LIMIT    (BIT(0))
#define APB_SARADC_SARADC_MEAS_NUM_LIMIT_M  (APB_SARADC_SARADC_MEAS_NUM_LIMIT_V << APB_SARADC_SARADC_MEAS_NUM_LIMIT_S)
#define APB_SARADC_SARADC_MEAS_NUM_LIMIT_V  0x00000001U
#define APB_SARADC_SARADC_MEAS_NUM_LIMIT_S  0
/** APB_SARADC_SARADC_MAX_MEAS_NUM : R/W; bitpos: [8:1]; default: 255;
 *  max conversion number
 */
#define APB_SARADC_SARADC_MAX_MEAS_NUM    0x000000FFU
#define APB_SARADC_SARADC_MAX_MEAS_NUM_M  (APB_SARADC_SARADC_MAX_MEAS_NUM_V << APB_SARADC_SARADC_MAX_MEAS_NUM_S)
#define APB_SARADC_SARADC_MAX_MEAS_NUM_V  0x000000FFU
#define APB_SARADC_SARADC_MAX_MEAS_NUM_S  1
/** APB_SARADC_SARADC_SAR1_INV : R/W; bitpos: [9]; default: 0;
 *  1: data to DIG ADC1 CTRL is inverted, otherwise not
 */
#define APB_SARADC_SARADC_SAR1_INV    (BIT(9))
#define APB_SARADC_SARADC_SAR1_INV_M  (APB_SARADC_SARADC_SAR1_INV_V << APB_SARADC_SARADC_SAR1_INV_S)
#define APB_SARADC_SARADC_SAR1_INV_V  0x00000001U
#define APB_SARADC_SARADC_SAR1_INV_S  9
/** APB_SARADC_SARADC_SAR2_INV : R/W; bitpos: [10]; default: 0;
 *  1: data to DIG ADC2 CTRL is inverted, otherwise not
 */
#define APB_SARADC_SARADC_SAR2_INV    (BIT(10))
#define APB_SARADC_SARADC_SAR2_INV_M  (APB_SARADC_SARADC_SAR2_INV_V << APB_SARADC_SARADC_SAR2_INV_S)
#define APB_SARADC_SARADC_SAR2_INV_V  0x00000001U
#define APB_SARADC_SARADC_SAR2_INV_S  10
/** APB_SARADC_SARADC_TIMER_TARGET : R/W; bitpos: [23:12]; default: 10;
 *  to set saradc timer target
 */
#define APB_SARADC_SARADC_TIMER_TARGET    0x00000FFFU
#define APB_SARADC_SARADC_TIMER_TARGET_M  (APB_SARADC_SARADC_TIMER_TARGET_V << APB_SARADC_SARADC_TIMER_TARGET_S)
#define APB_SARADC_SARADC_TIMER_TARGET_V  0x00000FFFU
#define APB_SARADC_SARADC_TIMER_TARGET_S  12
/** APB_SARADC_SARADC_TIMER_EN : R/W; bitpos: [24]; default: 0;
 *  to enable saradc timer trigger
 */
#define APB_SARADC_SARADC_TIMER_EN    (BIT(24))
#define APB_SARADC_SARADC_TIMER_EN_M  (APB_SARADC_SARADC_TIMER_EN_V << APB_SARADC_SARADC_TIMER_EN_S)
#define APB_SARADC_SARADC_TIMER_EN_V  0x00000001U
#define APB_SARADC_SARADC_TIMER_EN_S  24

/** APB_SARADC_FILTER_CTRL1_REG register
 *  digital saradc configure register
 */
#define APB_SARADC_FILTER_CTRL1_REG (DR_REG_APB_SARADC_BASE + 0x8)
/** APB_SARADC_APB_SARADC_FILTER_FACTOR1 : R/W; bitpos: [28:26]; default: 0;
 *  Factor of saradc filter1
 */
#define APB_SARADC_APB_SARADC_FILTER_FACTOR1    0x00000007U
#define APB_SARADC_APB_SARADC_FILTER_FACTOR1_M  (APB_SARADC_APB_SARADC_FILTER_FACTOR1_V << APB_SARADC_APB_SARADC_FILTER_FACTOR1_S)
#define APB_SARADC_APB_SARADC_FILTER_FACTOR1_V  0x00000007U
#define APB_SARADC_APB_SARADC_FILTER_FACTOR1_S  26
/** APB_SARADC_APB_SARADC_FILTER_FACTOR0 : R/W; bitpos: [31:29]; default: 0;
 *  Factor of saradc filter0
 */
#define APB_SARADC_APB_SARADC_FILTER_FACTOR0    0x00000007U
#define APB_SARADC_APB_SARADC_FILTER_FACTOR0_M  (APB_SARADC_APB_SARADC_FILTER_FACTOR0_V << APB_SARADC_APB_SARADC_FILTER_FACTOR0_S)
#define APB_SARADC_APB_SARADC_FILTER_FACTOR0_V  0x00000007U
#define APB_SARADC_APB_SARADC_FILTER_FACTOR0_S  29

/** APB_SARADC_FSM_WAIT_REG register
 *  digital saradc configure register
 */
#define APB_SARADC_FSM_WAIT_REG (DR_REG_APB_SARADC_BASE + 0xc)
/** APB_SARADC_SARADC_XPD_WAIT : R/W; bitpos: [7:0]; default: 8;
 *  saradc_xpd_wait
 */
#define APB_SARADC_SARADC_XPD_WAIT    0x000000FFU
#define APB_SARADC_SARADC_XPD_WAIT_M  (APB_SARADC_SARADC_XPD_WAIT_V << APB_SARADC_SARADC_XPD_WAIT_S)
#define APB_SARADC_SARADC_XPD_WAIT_V  0x000000FFU
#define APB_SARADC_SARADC_XPD_WAIT_S  0
/** APB_SARADC_SARADC_RSTB_WAIT : R/W; bitpos: [15:8]; default: 8;
 *  saradc_rstb_wait
 */
#define APB_SARADC_SARADC_RSTB_WAIT    0x000000FFU
#define APB_SARADC_SARADC_RSTB_WAIT_M  (APB_SARADC_SARADC_RSTB_WAIT_V << APB_SARADC_SARADC_RSTB_WAIT_S)
#define APB_SARADC_SARADC_RSTB_WAIT_V  0x000000FFU
#define APB_SARADC_SARADC_RSTB_WAIT_S  8
/** APB_SARADC_SARADC_STANDBY_WAIT : R/W; bitpos: [23:16]; default: 255;
 *  saradc_standby_wait
 */
#define APB_SARADC_SARADC_STANDBY_WAIT    0x000000FFU
#define APB_SARADC_SARADC_STANDBY_WAIT_M  (APB_SARADC_SARADC_STANDBY_WAIT_V << APB_SARADC_SARADC_STANDBY_WAIT_S)
#define APB_SARADC_SARADC_STANDBY_WAIT_V  0x000000FFU
#define APB_SARADC_SARADC_STANDBY_WAIT_S  16

