espressif/esp-idf/components/soc/esp32h2/register/soc/apb_saradc_reg.h
/** APB_SARADC_APB_TSENS_CTRL_REG register
 *  digital tsens configure register
 */
#define APB_SARADC_APB_TSENS_CTRL_REG (DR_REG_APB_SARADC_BASE + 0x58)
/** APB_SARADC_TSENS_OUT : RO; bitpos: [7:0]; default: 128;
 *  temperature sensor data out
 */
#define APB_SARADC_TSENS_OUT    0x000000FFU
#define APB_SARADC_TSENS_OUT_M  (APB_SARADC_TSENS_OUT_V << APB_SARADC_TSENS_OUT_S)
#define APB_SARADC_TSENS_OUT_V  0x000000FFU
#define APB_SARADC_TSENS_OUT_S  0
/** APB_SARADC_TSENS_IN_INV : R/W; bitpos: [13]; default: 0;
 *  invert temperature sensor data
 */
#define APB_SARADC_TSENS_IN_INV    (BIT(13))
#define APB_SARADC_TSENS_IN_INV_M  (APB_SARADC_TSENS_IN_INV_V << APB_SARADC_TSENS_IN_INV_S)
#define APB_SARADC_TSENS_IN_INV_V  0x00000001U
#define APB_SARADC_TSENS_IN_INV_S  13
/** APB_SARADC_TSENS_CLK_DIV : R/W; bitpos: [21:14]; default: 6;
 *  temperature sensor clock divider
 */
#define APB_SARADC_TSENS_CLK_DIV    0x000000FFU
#define APB_SARADC_TSENS_CLK_DIV_M  (APB_SARADC_TSENS_CLK_DIV_V << APB_SARADC_TSENS_CLK_DIV_S)
#define APB_SARADC_TSENS_CLK_DIV_V  0x000000FFU
#define APB_SARADC_TSENS_CLK_DIV_S  14
/** APB_SARADC_TSENS_PU : R/W; bitpos: [22]; default: 0;
 *  temperature sensor power up
 */
#define APB_SARADC_TSENS_PU    (BIT(22))
#define APB_SARADC_TSENS_PU_M  (APB_SARADC_TSENS_PU_V << APB_SARADC_TSENS_PU_S)
#define APB_SARADC_TSENS_PU_V  0x00000001U
#define APB_SARADC_TSENS_PU_S  22

/** APB_SARADC_TSENS_CTRL2_REG register
 *  digital tsens configure register
 */
#define APB_SARADC_TSENS_CTRL2_REG (DR_REG_APB_SARADC_BASE + 0x5c)
/** APB_SARADC_TSENS_XPD_WAIT : R/W; bitpos: [11:0]; default: 2;
 *  the time that power up tsens need wait
 */
#define APB_SARADC_TSENS_XPD_WAIT    0x00000FFFU
#define APB_SARADC_TSENS_XPD_WAIT_M  (APB_SARADC_TSENS_XPD_WAIT_V << APB_SARADC_TSENS_XPD_WAIT_S)
#define APB_SARADC_TSENS_XPD_WAIT_V  0x00000FFFU
#define APB_SARADC_TSENS_XPD_WAIT_S  0
/** APB_SARADC_TSENS_XPD_FORCE : R/W; bitpos: [13:12]; default: 0;
 *  force power up tsens
 */
#define APB_SARADC_TSENS_XPD_FORCE    0x00000003U
#define APB_SARADC_TSENS_XPD_FORCE_M  (APB_SARADC_TSENS_XPD_FORCE_V << APB_SARADC_TSENS_XPD_FORCE_S)
#define APB_SARADC_TSENS_XPD_FORCE_V  0x00000003U
#define APB_SARADC_TSENS_XPD_FORCE_S  12
/** APB_SARADC_TSENS_CLK_INV : R/W; bitpos: [14]; default: 1;
 *  inv tsens clk
 */
#define APB_SARADC_TSENS_CLK_INV    (BIT(14))
#define APB_SARADC_TSENS_CLK_INV_M  (APB_SARADC_TSENS_CLK_INV_V << APB_SARADC_TSENS_CLK_INV_S)
#define APB_SARADC_TSENS_CLK_INV_V  0x00000001U
#define APB_SARADC_TSENS_CLK_INV_S  14
/** APB_SARADC_TSENS_CLK_SEL : R/W; bitpos: [15]; default: 0;
 *  tsens clk select
 */
#define APB_SARADC_TSENS_CLK_SEL    (BIT(15))
#define APB_SARADC_TSENS_CLK_SEL_M  (APB_SARADC_TSENS_CLK_SEL_V << APB_SARADC_TSENS_CLK_SEL_S)
#define APB_SARADC_TSENS_CLK_SEL_V  0x00000001U
#define APB_SARADC_TSENS_CLK_SEL_S  15

/** APB_SARADC_CALI_REG register
 *  digital saradc configure register
 */
#define APB_SARADC_CALI_REG (DR_REG_APB_SARADC_BASE + 0x60)
/** APB_SARADC_APB_SARADC_CALI_CFG : R/W; bitpos: [16:0]; default: 32768;
 *  saradc cali factor
 */
#define APB_SARADC_APB_SARADC_CALI_CFG    0x0001FFFFU
#define APB_SARADC_APB_SARADC_CALI_CFG_M  (APB_SARADC_APB_SARADC_CALI_CFG_V << APB_SARADC_APB_SARADC_CALI_CFG_S)
#define APB_SARADC_APB_SARADC_CALI_CFG_V  0x0001FFFFU
#define APB_SARADC_APB_SARADC_CALI_CFG_S  0

/** APB_TSENS_WAKE_REG register
 *  digital tsens configure register
 */
#define APB_TSENS_WAKE_REG (DR_REG_APB_SARADC_BASE + 0x64)
/** APB_SARADC_WAKEUP_TH_LOW : R/W; bitpos: [7:0]; default: 0;
 *  reg_wakeup_th_low
 */
#define APB_SARADC_WAKEUP_TH_LOW    0x000000FFU
#define APB_SARADC_WAKEUP_TH_LOW_M  (APB_SARADC_WAKEUP_TH_LOW_V << APB_SARADC_WAKEUP_TH_LOW_S)
#define APB_SARADC_WAKEUP_TH_LOW_V  0x000000FFU
#define APB_SARADC_WAKEUP_TH_LOW_S  0
/** APB_SARADC_WAKEUP_TH_HIGH : R/W; bitpos: [15:8]; default: 255;
 *  reg_wakeup_th_high
 */
#define APB_SARADC_WAKEUP_TH_HIGH    0x000000FFU
#define APB_SARADC_WAKEUP_TH_HIGH_M  (APB_SARADC_WAKEUP_TH_HIGH_V << APB_SARADC_WAKEUP_TH_HIGH_S)
#define APB_SARADC_WAKEUP_TH_HIGH_V  0x000000FFU
#define APB_SARADC_WAKEUP_TH_HIGH_S  8
/** APB_SARADC_WAKEUP_OVER_UPPER_TH : RO; bitpos: [16]; default: 0;
 *  reg_wakeup_over_upper_th
 */
#define APB_SARADC_WAKEUP_OVER_UPPER_TH    (BIT(16))
#define APB_SARADC_WAKEUP_OVER_UPPER_TH_M  (APB_SARADC_WAKEUP_OVER_UPPER_TH_V << APB_SARADC_WAKEUP_OVER_UPPER_TH_S)
#define APB_SARADC_WAKEUP_OVER_UPPER_TH_V  0x00000001U
#define APB_SARADC_WAKEUP_OVER_UPPER_TH_S  16
/** APB_SARADC_WAKEUP_MODE : R/W; bitpos: [17]; default: 0;
 *  reg_wakeup_mode
 */
#define APB_SARADC_WAKEUP_MODE    (BIT(17))
#define APB_SARADC_WAKEUP_MODE_M  (APB_SARADC_WAKEUP_MODE_V << APB_SARADC_WAKEUP_MODE_S)
#define APB_SARADC_WAKEUP_MODE_V  0x00000001U
#define APB_SARADC_WAKEUP_MODE_S  17
/** APB_SARADC_WAKEUP_EN : R/W; bitpos: [18]; default: 0;
 *  reg_wakeup_en
 */
#define APB_SARADC_WAKEUP_EN    (BIT(18))
#define APB_SARADC_WAKEUP_EN_M  (APB_SARADC_WAKEUP_EN_V << APB_SARADC_WAKEUP_EN_S)
#define APB_SARADC_WAKEUP_EN_V  0x00000001U
#define APB_SARADC_WAKEUP_EN_S  18

/** APB_TSENS_SAMPLE_REG register
 *  digital tsens configure register
 */
#define APB_TSENS_SAMPLE_REG (DR_REG_APB_SARADC_BASE + 0x68)
/** APB_SARADC_TSENS_SAMPLE_RATE : R/W; bitpos: [15:0]; default: 20;
 *  HW sample rate
 */
#define APB_SARADC_TSENS_SAMPLE_RATE    0x0000FFFFU
#define APB_SARADC_TSENS_SAMPLE_RATE_M  (APB_SARADC_TSENS_SAMPLE_RATE_V << APB_SARADC_TSENS_SAMPLE_RATE_S)
#define APB_SARADC_TSENS_SAMPLE_RATE_V  0x0000FFFFU
#define APB_SARADC_TSENS_SAMPLE_RATE_S  0
/** APB_SARADC_TSENS_SAMPLE_EN : R/W; bitpos: [16]; default: 0;
 *  HW sample en
 */
#define APB_SARADC_TSENS_SAMPLE_EN    (BIT(16))
#define APB_SARADC_TSENS_SAMPLE_EN_M  (APB_SARADC_TSENS_SAMPLE_EN_V << APB_SARADC_TSENS_SAMPLE_EN_S)
#define APB_SARADC_TSENS_SAMPLE_EN_V  0x00000001U
#define APB_SARADC_TSENS_SAMPLE_EN_S  16

/** APB_SARADC_CTRL_DATE_REG register
 *  version
 */
#define APB_SARADC_CTRL_DATE_REG (DR_REG_APB_SARADC_BASE + 0x3fc)
/** APB_SARADC_DATE : R/W; bitpos: [31:0]; default: 35676736;
 *  version
 */
#define APB_SARADC_DATE    0xFFFFFFFFU
#define APB_SARADC_DATE_M  (APB_SARADC_DATE_V << APB_SARADC_DATE_S)
#define APB_SARADC_DATE_V  0xFFFFFFFFU
#define APB_SARADC_DATE_S  0

#ifdef __cplusplus
}
#endif
